package com.java.review.linux;

public class LinuxTest {
}

/**
 * 1.当使用RMI技术实现远程方法调用时，能为远程对象生成Sub和Skeleton命令的是？
 *  Mic
 * 2.面向连接的的协议是？
 *  传输控制协议
 * 3.Linux 文件权限一共10 位长度，分成四段，第三段表示的内容是？
 *  文件所有者所在组的权限
 * 4.在使用mkdir 命令创建新的目录时，在其父目录不存在时先创建父目录？
 *  -p
 * 5.关于i节点？
 *  i节点能描述文件占用的块数
 *  i节点描述了文件大小和指向数据块的指针
 *  通过i节点实现文件的逻辑结构和物理结构的转换
 * 6.一个文件名字为rr.Z，可以用来解压缩的命令是？
 *  uncompress
 * 7.具有很多C语言的功能，又称过滤器的是？
 *  awk
 * 8.一台主机要实现通过局域网与另一个局域网通信，需要做的工作是？
 *  定义一条本机指向所在网络网关的路由
 * 9.建立动态路由需要用到的文件有？
 *  /etc/gateways
 * 10.ifconfig 命令作用范围的是？
 *  配置本地回环地址
 *  配置网卡的IP地址
 *  激活网络适配器
 * 11.硬链接就是让链接文件的i节点号指向被链接文件的i节点
 * 12.链接分为硬链接和符号链接
 * 13.硬连接不能链接目录文件
 * 14.在局域网络内的某台主机用ping 命令测试网络连接时发现网络内部的主机都可以连同，而不能与公网连通，问题可能是？
 *  局域网的网关或主机的网关设置有误
 * 15.包含了主机名到IP 地址的映射关系的文件是？
 *  /etc/hosts
 * 16.需要编译内核的情况是？
 *  删除系统不用的设备驱动程序时
 *  升级内核时
 *  添加新硬件时
 * 17.在shell 中变量的赋值有四种方法，其中，采用name=12的方法称？
 *  直接赋值
 * 18.从文本文件的每一行中截取指定内容的数据命令？
 *  cut
 * 19.Linux系统进程？
 *  交互进程
 *  批处理进程
 *  守护进程
 * 20.在日常管理中，通常CPU会影响系统性能的情况是？
 *  CPU已满负荷地运转
 * 21.若一台计算机的内存为128MB，则交换分区的大小通常是？
 *  256MB
 * 22.Linux 有三个查看文件的命令，若希望在查看文件内容过程中可以用光标上下移动来查看文件内容，应使用？
 *  less
 * 23.在TCP/IP 模型中，应用层包含了所有的高层协议，在下列的一些应用协议中，什么是能够实现本地与远程主机之间的文件传输工作？
 *  FTP
 * 24.当我们与某远程网络连接不上时，就需要跟踪路由查看，以便了解在网络的什么位置出现了问题，满足该目的的命令是？
 *  traceroute
 * 26.对名为fido 的文件用chmod 551 fido 进行了修改，则它的许可权是？
 *  -r--r--r--
 * 27.DNS 域名系统主要负责主机名和什么间的解析？
 *  IP地址
 * 28.WWW 服务器是在Internet 上使用最为广泛，它采用的是什么结构？
 *  B/S
 * 29.Linux 系统通过什么命令给其他用户发消息？
 *  write
 * 30.NFS是网络文件系统
 * 31.什么命令可以在Linux的安全系统中完成文件向磁带备份的工作？
 *  cpio
 * 32.Linux 文件系统的文件都按其作用分门别类地放在相关的目录中，对于外部设备文件，一般应将其放在/etc目录中
 * 33.在重新启动Linux 系统的同时把内存中的信息写入硬盘，应使用什么命令实现？
 *   shutdown –r now
 * 34.网络管理具备以下几大功能？
 *  配置管理、故障管理、性能管理、安全管理和计费管理等
 * 35.关闭linux 系统（不重新启动）可使用命令？
 *  halt
 * 36.实现从IP 地址到以太网MAC 地址转换的命令为？
 *  ifconfig
 * 37.在vi 编辑器中的命令模式下，重复上一次对编辑的文本进行的操作，可使用？
 *  < .>;
 * 38.退出交互模式的shell，应键入？
 *  exit
 */



















































